openocd-org/openocd/src/flash/nand/lpc32xx.c
// SPDX-License-Identifier: GPL-2.0-or-later

/***************************************************************************
 *   Copyright (C) 2007 by Dominic Rath                                    *
 *   Dominic.Rath@gmx.de                                                   *
 *                                                                         *
 *   Copyright (C) 2011 Bjarne Steinsbo <bsteinsbo@gmail.com>              *
 *   Copyright (C) 2010 richard vegh <vegh.ricsi@gmail.com>                *
 *   Copyright (C) 2010 Oyvind Harboe <oyvind.harboe@zylin.com>            *
 *                                                                         *
 *   Based on a combination of the lpc3180 driver and code from            *
 *   uboot-2009.03-lpc32xx by Kevin Wells.                                 *
 *   Any bugs are mine. --BSt                                              *
 ***************************************************************************/

#ifdef HAVE_CONFIG_H
#include "config.h"
#endif

#include "imp.h"
#include "lpc32xx.h"
#include <target/target.h>

static int lpc32xx_reset(struct nand_device *nand);
static int lpc32xx_controller_ready(struct nand_device *nand, int timeout);
static int lpc32xx_tc_ready(struct nand_device *nand, int timeout);

/* These are offset with the working area in IRAM when using DMA to
 * read/write data to the SLC controller.
 * - DMA descriptors will be put at start of working area,
 * - Hardware generated ECC will be stored at ECC_OFFS
 * - OOB will be read/written from/to SPARE_OFFS
 * - Actual page data will be read from/to DATA_OFFS
 * There are unused holes between the used areas.
 */
#define ECC_OFFS   0x120
#define SPARE_OFFS 0x140
#define DATA_OFFS  0x200

static const int sp_ooblayout[] = {
	10, 11, 12, 13, 14, 15
};
static const int lp_ooblayout[] = {
	40, 41, 42, 43, 44, 45,
	46, 47, 48, 49, 50, 51,
	52, 53, 54, 55, 56, 57,
	58, 59, 60, 61, 62, 63
};

struct dmac_ll {
	volatile uint32_t dma_src;
	volatile uint32_t dma_dest;
	volatile uint32_t next_lli;
	volatile uint32_t next_ctrl;
};

static struct dmac_ll dmalist[(2048/256) * 2 + 1];

/* nand device lpc32xx <target#> <oscillator_frequency>
 */
NAND_DEVICE_COMMAND_HANDLER(lpc32xx_nand_device_command)
{
	if (CMD_ARGC < 3)
		return ERROR_COMMAND_SYNTAX_ERROR;

	uint32_t osc_freq;
	COMMAND_PARSE_NUMBER(u32, CMD_ARGV[2], osc_freq);

	struct lpc32xx_nand_controller *lpc32xx_info;
	lpc32xx_info = malloc(sizeof(struct lpc32xx_nand_controller));
	nand->controller_priv = lpc32xx_info;

	lpc32xx_info->osc_freq = osc_freq;

	if ((lpc32xx_info->osc_freq < 1000) || (lpc32xx_info->osc_freq > 20000))
		LOG_WARNING("LPC32xx oscillator frequency should be between "
			"1000 and 20000 kHz, was %i",
			lpc32xx_info->osc_freq);

	lpc32xx_info->selected_controller = LPC32XX_NO_CONTROLLER;
	lpc32xx_info->sw_write_protection = 0;
	lpc32xx_info->sw_wp_lower_bound = 0x0;
	lpc32xx_info->sw_wp_upper_bound = 0x0;

	return ERROR_OK;
}

static int lpc32xx_pll(int fclkin, uint32_t pll_ctrl)
{
	int bypass = (pll_ctrl & 0x8000) >> 15;
	int direct = (pll_ctrl & 0x4000) >> 14;
	int feedback = (pll_ctrl & 0x2000) >> 13;
	int p = (1 << ((pll_ctrl & 0x1800) >> 11) * 2);
	int n = ((pll_ctrl & 0x0600) >> 9) + 1;
	int m = ((pll_ctrl & 0x01fe) >> 1) + 1;
	int lock = (pll_ctrl & 0x1);

	if (!lock)
		LOG_WARNING("PLL is not locked");

	if (!bypass && direct)	/* direct mode */
		return (m * fclkin) / n;

	if (bypass && !direct)	/* bypass mode */
		return fclkin / (2 * p);

	if (bypass & direct)	/* direct bypass mode */
		return fclkin;

	if (feedback)	/* integer mode */
		return m * (fclkin / n);
	else	/* non-integer mode */
		return (m / (2 * p)) * (fclkin / n);
}

static float lpc32xx_cycle_time(struct nand_device *nand)
{
	struct lpc32xx_nand_controller *lpc32xx_info = nand->controller_priv;
	struct target *target = nand->target;
	uint32_t sysclk_ctrl, pwr_ctrl, hclkdiv_ctrl, hclkpll_ctrl;
	int sysclk;
	int hclk;
	int hclk_pll;
	int retval;

	/* calculate timings */

	/* determine current SYSCLK (13'MHz or main oscillator) */
	retval = target_read_u32(target, 0x40004050, &sysclk_ctrl);
	if (retval != ERROR_OK) {
		LOG_ERROR("could not read SYSCLK_CTRL");
		return ERROR_NAND_OPERATION_FAILED;
	}

	if ((sysclk_ctrl & 1) == 0)
		sysclk = lpc32xx_info->osc_freq;
	else
		sysclk = 13000;

	/* determine selected HCLK source */
	retval = target_read_u32(target, 0x40004044, &pwr_ctrl);
	if (retval != ERROR_OK) {
		LOG_ERROR("could not read HCLK_CTRL");
		return ERROR_NAND_OPERATION_FAILED;
	}

	if ((pwr_ctrl & (1 << 2)) == 0)		/* DIRECT RUN mode */
		hclk = sysclk;
	else {
		retval = target_read_u32(target, 0x40004058, &hclkpll_ctrl);
		if (retval != ERROR_OK) {
			LOG_ERROR("could not read HCLKPLL_CTRL");
			return ERROR_NAND_OPERATION_FAILED;
		}
		hclk_pll = lpc32xx_pll(sysclk, hclkpll_ctrl);

		retval = target_read_u32(target, 0x40004040, &hclkdiv_ctrl);
		if (retval != ERROR_OK) {
			LOG_ERROR("could not read CLKDIV_CTRL");
			return ERROR_NAND_OPERATION_FAILED;
		}

		if (pwr_ctrl & (1 << 10))	/* ARM_CLK and HCLK use PERIPH_CLK */
			hclk = hclk_pll / (((hclkdiv_ctrl & 0x7c) >> 2) + 1);
		else	/* HCLK uses HCLK_PLL */
			hclk = hclk_pll / (1 << (hclkdiv_ctrl & 0x3));
	}

	LOG_DEBUG("LPC32xx HCLK currently clocked at %i kHz", hclk);

	return (1.0 / hclk) * 1000000.0;
}

static int lpc32xx_init(struct nand_device *nand)
{
	struct lpc32xx_nand_controller *lpc32xx_info = nand->controller_priv;
	struct target *target = nand->target;
	int bus_width = nand->bus_width ? nand->bus_width : 8;
	int address_cycles = nand->address_cycles ? nand->address_cycles : 3;
	int page_size = nand->page_size ? nand->page_size : 512;
	int retval;

	if (target->state != TARGET_HALTED) {
		LOG_ERROR("target must be halted to use LPC32xx "
			"NAND flash controller");
		return ERROR_NAND_OPERATION_FAILED;
	}

	/* sanitize arguments */
	if (bus_width != 8) {
		LOG_ERROR("LPC32xx doesn't support %i", bus_width);
		return ERROR_NAND_OPERATION_NOT_SUPPORTED;
	}

