openocd-org/openocd/src/flash/nand/lpc32xx.c
	/* inform calling code about selected bus width */
	nand->bus_width = bus_width;

	if ((address_cycles < 3) || (address_cycles > 5)) {
		LOG_ERROR("LPC32xx driver doesn't support %i address cycles", address_cycles);
		return ERROR_NAND_OPERATION_NOT_SUPPORTED;
	}

	if ((page_size != 512) && (page_size != 2048)) {
		LOG_ERROR("LPC32xx doesn't support page size %i", page_size);
		return ERROR_NAND_OPERATION_NOT_SUPPORTED;
	}

	/* select MLC controller if none is currently selected */
	if (lpc32xx_info->selected_controller == LPC32XX_NO_CONTROLLER) {
		LOG_DEBUG("no LPC32xx NAND flash controller selected, "
			"using default 'slc'");
		lpc32xx_info->selected_controller = LPC32XX_SLC_CONTROLLER;
	}

	if (lpc32xx_info->selected_controller == LPC32XX_MLC_CONTROLLER) {
		uint32_t mlc_icr_value = 0x0;
		float cycle;
		int twp, twh, trp, treh, trhz, trbwb, tcea;

		/* FLASHCLK_CTRL = 0x22 (enable clk for MLC) */
		retval = target_write_u32(target, 0x400040c8, 0x22);
		if (retval != ERROR_OK) {
			LOG_ERROR("could not set FLASHCLK_CTRL");
			return ERROR_NAND_OPERATION_FAILED;
		}

		/* MLC_CEH = 0x0 (Force nCE assert) */
		retval = target_write_u32(target, 0x200b804c, 0x0);
		if (retval != ERROR_OK) {
			LOG_ERROR("could not set MLC_CEH");
			return ERROR_NAND_OPERATION_FAILED;
		}

		/* MLC_LOCK = 0xa25e (unlock protected registers) */
		retval = target_write_u32(target, 0x200b8044, 0xa25e);
		if (retval != ERROR_OK) {
			LOG_ERROR("could not set MLC_LOCK");
			return ERROR_NAND_OPERATION_FAILED;
		}

		/* MLC_ICR = configuration */
		if (lpc32xx_info->sw_write_protection)
			mlc_icr_value |= 0x8;
		if (page_size == 2048)
			mlc_icr_value |= 0x4;
		if (address_cycles == 4)
			mlc_icr_value |= 0x2;
		if (bus_width == 16)
			mlc_icr_value |= 0x1;
		retval = target_write_u32(target, 0x200b8030, mlc_icr_value);
		if (retval != ERROR_OK) {
			LOG_ERROR("could not set MLC_ICR");
			return ERROR_NAND_OPERATION_FAILED;
		}

		/* calculate NAND controller timings */
		cycle = lpc32xx_cycle_time(nand);

		twp = ((40 / cycle) + 1);
		twh = ((20 / cycle) + 1);
		trp = ((30 / cycle) + 1);
		treh = ((15 / cycle) + 1);
		trhz = ((30 / cycle) + 1);
		trbwb = ((100 / cycle) + 1);
		tcea = ((45 / cycle) + 1);

		/* MLC_LOCK = 0xa25e (unlock protected registers) */
		retval = target_write_u32(target, 0x200b8044, 0xa25e);
		if (retval != ERROR_OK) {
			LOG_ERROR("could not set MLC_LOCK");
			return ERROR_NAND_OPERATION_FAILED;
		}

		/* MLC_TIME_REG */
		retval = target_write_u32(target, 0x200b8034,
				(twp & 0xf)
				| ((twh & 0xf) << 4)
				| ((trp & 0xf) << 8)
				| ((treh & 0xf) << 12)
				| ((trhz & 0x7) << 16)
				| ((trbwb & 0x1f) << 19)
				| ((tcea & 0x3) << 24));
		if (retval != ERROR_OK) {
			LOG_ERROR("could not set MLC_TIME_REG");
			return ERROR_NAND_OPERATION_FAILED;
		}

		retval = lpc32xx_reset(nand);
		if (retval != ERROR_OK)
			return ERROR_NAND_OPERATION_FAILED;
	} else if (lpc32xx_info->selected_controller == LPC32XX_SLC_CONTROLLER) {
		float cycle;
		int r_setup, r_hold, r_width, r_rdy;
		int w_setup, w_hold, w_width, w_rdy;

		/* FLASHCLK_CTRL = 0x05 (enable clk for SLC) */
		retval = target_write_u32(target, 0x400040c8, 0x05);
		if (retval != ERROR_OK) {
			LOG_ERROR("could not set FLASHCLK_CTRL");
			return ERROR_NAND_OPERATION_FAILED;
		}

		/* after reset set other registers of SLC,
		 * so reset calling is here at the beginning
		 */
		retval = lpc32xx_reset(nand);
		if (retval != ERROR_OK)
			return ERROR_NAND_OPERATION_FAILED;

		/* SLC_CFG =
			Force nCE assert,
			DMA ECC enabled,
			ECC enabled,
			DMA burst enabled,
			DMA read from SLC,
			WIDTH = bus_width)
		*/
		retval = target_write_u32(target, 0x20020014,
				0x3e | ((bus_width == 16) ? 1 : 0));
		if (retval != ERROR_OK) {
			LOG_ERROR("could not set SLC_CFG");
			return ERROR_NAND_OPERATION_FAILED;
		}

		/* SLC_IEN = 3 (INT_RDY_EN = 1) ,(INT_TC_STAT = 1) */
		retval = target_write_u32(target, 0x20020020, 0x03);
		if (retval != ERROR_OK) {
			LOG_ERROR("could not set SLC_IEN");
			return ERROR_NAND_OPERATION_FAILED;
		}

		/* DMA configuration */

		/* DMACLK_CTRL = 0x01 (enable clock for DMA controller) */
		retval = target_write_u32(target, 0x400040e8, 0x01);
		if (retval != ERROR_OK) {
			LOG_ERROR("could not set DMACLK_CTRL");
			return ERROR_NAND_OPERATION_FAILED;
		}

		/* DMACConfig = DMA enabled*/
		retval = target_write_u32(target, 0x31000030, 0x01);
		if (retval != ERROR_OK) {
			LOG_ERROR("could not set DMACConfig");
			return ERROR_NAND_OPERATION_FAILED;
		}

		/* calculate NAND controller timings */
		cycle = lpc32xx_cycle_time(nand);

		r_setup = w_setup = 0;
		r_hold = w_hold = 10 / cycle;
		r_width = 30 / cycle;
		w_width = 40 / cycle;
		r_rdy = w_rdy = 100 / cycle;

		/* SLC_TAC: SLC timing arcs register */
		retval = target_write_u32(target, 0x2002002c,
				(r_setup & 0xf)
				| ((r_hold & 0xf) << 4)
				| ((r_width & 0xf) << 8)
				| ((r_rdy & 0xf) << 12)
				| ((w_setup & 0xf) << 16)
				| ((w_hold & 0xf) << 20)
				| ((w_width & 0xf) << 24)
				| ((w_rdy & 0xf) << 28));
		if (retval != ERROR_OK) {
			LOG_ERROR("could not set SLC_TAC");
			return ERROR_NAND_OPERATION_FAILED;
		}
	}

	return ERROR_OK;
}

static int lpc32xx_reset(struct nand_device *nand)
{
	struct lpc32xx_nand_controller *lpc32xx_info = nand->controller_priv;
	struct target *target = nand->target;
	int retval;

	if (target->state != TARGET_HALTED) {
		LOG_ERROR("target must be halted to use "
			"LPC32xx NAND flash controller");
		return ERROR_NAND_OPERATION_FAILED;
	}

	if (lpc32xx_info->selected_controller == LPC32XX_NO_CONTROLLER) {
		LOG_ERROR("BUG: no LPC32xx NAND flash controller selected");
		return ERROR_NAND_OPERATION_FAILED;
	} else if (lpc32xx_info->selected_controller == LPC32XX_MLC_CONTROLLER) {
		/* MLC_CMD = 0xff (reset controller and NAND device) */
		retval = target_write_u32(target, 0x200b8000, 0xff);
		if (retval != ERROR_OK) {
			LOG_ERROR("could not set MLC_CMD");
			return ERROR_NAND_OPERATION_FAILED;
		}

		if (!lpc32xx_controller_ready(nand, 100)) {
			LOG_ERROR("LPC32xx MLC NAND controller timed out "
				"after reset");
			return ERROR_NAND_OPERATION_TIMEOUT;
		}
	} else if (lpc32xx_info->selected_controller == LPC32XX_SLC_CONTROLLER) {
		/* SLC_CTRL = 0x6 (ECC_CLEAR, SW_RESET) */
		retval = target_write_u32(target, 0x20020010, 0x6);
		if (retval != ERROR_OK) {
			LOG_ERROR("could not set SLC_CTRL");
			return ERROR_NAND_OPERATION_FAILED;
		}

		if (!lpc32xx_controller_ready(nand, 100)) {
			LOG_ERROR("LPC32xx SLC NAND controller timed out "
				"after reset");
			return ERROR_NAND_OPERATION_TIMEOUT;
		}
	}

	return ERROR_OK;
}

static int lpc32xx_command(struct nand_device *nand, uint8_t command)
{
	struct lpc32xx_nand_controller *lpc32xx_info = nand->controller_priv;
	struct target *target = nand->target;
	int retval;

	if (target->state != TARGET_HALTED) {
		LOG_ERROR("target must be halted to use "
			"LPC32xx NAND flash controller");
		return ERROR_NAND_OPERATION_FAILED;
	}

	if (lpc32xx_info->selected_controller == LPC32XX_NO_CONTROLLER) {
		LOG_ERROR("BUG: no LPC32xx NAND flash controller selected");
		return ERROR_NAND_OPERATION_FAILED;
	} else if (lpc32xx_info->selected_controller == LPC32XX_MLC_CONTROLLER) {
		/* MLC_CMD = command */
		retval = target_write_u32(target, 0x200b8000, command);
		if (retval != ERROR_OK) {
			LOG_ERROR("could not set MLC_CMD");
			return ERROR_NAND_OPERATION_FAILED;
		}
	} else if (lpc32xx_info->selected_controller == LPC32XX_SLC_CONTROLLER) {
		/* SLC_CMD = command */
		retval = target_write_u32(target, 0x20020008, command);
		if (retval != ERROR_OK) {
			LOG_ERROR("could not set SLC_CMD");
			return ERROR_NAND_OPERATION_FAILED;
		}
	}

	return ERROR_OK;
}

