openocd-org/openocd/src/flash/nand/lpc32xx.c
static int lpc32xx_address(struct nand_device *nand, uint8_t address)
{
	struct lpc32xx_nand_controller *lpc32xx_info = nand->controller_priv;
	struct target *target = nand->target;
	int retval;

	if (target->state != TARGET_HALTED) {
		LOG_ERROR("target must be halted to use "
			"LPC32xx NAND flash controller");
		return ERROR_NAND_OPERATION_FAILED;
	}

	if (lpc32xx_info->selected_controller == LPC32XX_NO_CONTROLLER) {
		LOG_ERROR("BUG: no LPC32xx NAND flash controller selected");
		return ERROR_NAND_OPERATION_FAILED;
	} else if (lpc32xx_info->selected_controller == LPC32XX_MLC_CONTROLLER) {
		/* MLC_ADDR = address */
		retval = target_write_u32(target, 0x200b8004, address);
		if (retval != ERROR_OK) {
			LOG_ERROR("could not set MLC_ADDR");
			return ERROR_NAND_OPERATION_FAILED;
		}
	} else if (lpc32xx_info->selected_controller == LPC32XX_SLC_CONTROLLER) {
		/* SLC_ADDR = address */
		retval = target_write_u32(target, 0x20020004, address);
		if (retval != ERROR_OK) {
			LOG_ERROR("could not set SLC_ADDR");
			return ERROR_NAND_OPERATION_FAILED;
		}
	}

	return ERROR_OK;
}

static int lpc32xx_write_data(struct nand_device *nand, uint16_t data)
{
	struct lpc32xx_nand_controller *lpc32xx_info = nand->controller_priv;
	struct target *target = nand->target;
	int retval;

	if (target->state != TARGET_HALTED) {
		LOG_ERROR("target must be halted to use "
			"LPC32xx NAND flash controller");
		return ERROR_NAND_OPERATION_FAILED;
	}

	if (lpc32xx_info->selected_controller == LPC32XX_NO_CONTROLLER) {
		LOG_ERROR("BUG: no LPC32xx NAND flash controller selected");
		return ERROR_NAND_OPERATION_FAILED;
	} else if (lpc32xx_info->selected_controller == LPC32XX_MLC_CONTROLLER) {
		/* MLC_DATA = data */
		retval = target_write_u32(target, 0x200b0000, data);
		if (retval != ERROR_OK) {
			LOG_ERROR("could not set MLC_DATA");
			return ERROR_NAND_OPERATION_FAILED;
		}
	} else if (lpc32xx_info->selected_controller == LPC32XX_SLC_CONTROLLER) {
		/* SLC_DATA = data */
		retval = target_write_u32(target, 0x20020000, data);
		if (retval != ERROR_OK) {
			LOG_ERROR("could not set SLC_DATA");
			return ERROR_NAND_OPERATION_FAILED;
		}
	}

	return ERROR_OK;
}

static int lpc32xx_read_data(struct nand_device *nand, void *data)
{
	struct lpc32xx_nand_controller *lpc32xx_info = nand->controller_priv;
	struct target *target = nand->target;
	int retval;

	if (target->state != TARGET_HALTED) {
		LOG_ERROR("target must be halted to use LPC32xx "
			"NAND flash controller");
		return ERROR_NAND_OPERATION_FAILED;
	}

	if (lpc32xx_info->selected_controller == LPC32XX_NO_CONTROLLER) {
		LOG_ERROR("BUG: no LPC32xx NAND flash controller selected");
		return ERROR_NAND_OPERATION_FAILED;
	} else if (lpc32xx_info->selected_controller == LPC32XX_MLC_CONTROLLER) {
		/* data = MLC_DATA, use sized access */
		if (nand->bus_width == 8) {
			uint8_t *data8 = data;
			retval = target_read_u8(target, 0x200b0000, data8);
		} else {
			LOG_ERROR("BUG: bus_width neither 8 nor 16 bit");
			return ERROR_NAND_OPERATION_FAILED;
		}
		if (retval != ERROR_OK) {
			LOG_ERROR("could not read MLC_DATA");
			return ERROR_NAND_OPERATION_FAILED;
		}
	} else if (lpc32xx_info->selected_controller == LPC32XX_SLC_CONTROLLER) {
		uint32_t data32;

		/* data = SLC_DATA, must use 32-bit access */
		retval = target_read_u32(target, 0x20020000, &data32);
		if (retval != ERROR_OK) {
			LOG_ERROR("could not read SLC_DATA");
			return ERROR_NAND_OPERATION_FAILED;
		}

		if (nand->bus_width == 8) {
			uint8_t *data8 = data;
			*data8 = data32 & 0xff;
		} else {
			LOG_ERROR("BUG: bus_width neither 8 nor 16 bit");
			return ERROR_NAND_OPERATION_FAILED;
		}
	}

	return ERROR_OK;
}

static int lpc32xx_write_page_mlc(struct nand_device *nand, uint32_t page,
	uint8_t *data, uint32_t data_size,
	uint8_t *oob, uint32_t oob_size)
{
	struct target *target = nand->target;
	int retval;
	uint8_t status;
	static uint8_t page_buffer[512];
	static uint8_t oob_buffer[6];
	int quarter, num_quarters;

	/* MLC_CMD = sequential input */
	retval = target_write_u32(target, 0x200b8000, NAND_CMD_SEQIN);
	if (retval != ERROR_OK) {
		LOG_ERROR("could not set MLC_CMD");
		return ERROR_NAND_OPERATION_FAILED;
	}

	if (nand->page_size == 512) {
		/* MLC_ADDR = 0x0 (one column cycle) */
		retval = target_write_u32(target, 0x200b8004, 0x0);
		if (retval != ERROR_OK) {
			LOG_ERROR("could not set MLC_ADDR");
			return ERROR_NAND_OPERATION_FAILED;
		}

		/* MLC_ADDR = row */
		retval = target_write_u32(target, 0x200b8004, page & 0xff);
		if (retval != ERROR_OK) {
			LOG_ERROR("could not set MLC_ADDR");
			return ERROR_NAND_OPERATION_FAILED;
		}
		retval = target_write_u32(target, 0x200b8004,
				(page >> 8) & 0xff);
		if (retval != ERROR_OK) {
			LOG_ERROR("could not set MLC_ADDR");
			return ERROR_NAND_OPERATION_FAILED;
		}

		if (nand->address_cycles == 4) {
			retval = target_write_u32(target, 0x200b8004,
					(page >> 16) & 0xff);
			if (retval != ERROR_OK) {
				LOG_ERROR("could not set MLC_ADDR");
				return ERROR_NAND_OPERATION_FAILED;
			}
		}
	} else {
		/* MLC_ADDR = 0x0 (two column cycles) */
		retval = target_write_u32(target, 0x200b8004, 0x0);
		if (retval != ERROR_OK) {
			LOG_ERROR("could not set MLC_ADDR");
			return ERROR_NAND_OPERATION_FAILED;
		}
		retval = target_write_u32(target, 0x200b8004, 0x0);
		if (retval != ERROR_OK) {
			LOG_ERROR("could not set MLC_ADDR");
			return ERROR_NAND_OPERATION_FAILED;
		}

		/* MLC_ADDR = row */
		retval = target_write_u32(target, 0x200b8004, page & 0xff);
		if (retval != ERROR_OK) {
			LOG_ERROR("could not set MLC_ADDR");
			return ERROR_NAND_OPERATION_FAILED;
		}
		retval = target_write_u32(target, 0x200b8004,
				(page >> 8) & 0xff);
		if (retval != ERROR_OK) {
			LOG_ERROR("could not set MLC_ADDR");
			return ERROR_NAND_OPERATION_FAILED;
		}
	}

	/* when using the MLC controller, we have to treat a large page device
	 * as being made out of four quarters, each the size of a small page
	 * device
	 */
	num_quarters = (nand->page_size == 2048) ? 4 : 1;

	for (quarter = 0; quarter < num_quarters; quarter++) {
		int thisrun_data_size = (data_size > 512) ? 512 : data_size;
		int thisrun_oob_size = (oob_size > 6) ? 6 : oob_size;

		memset(page_buffer, 0xff, 512);
		if (data) {
			memcpy(page_buffer, data, thisrun_data_size);
			data_size -= thisrun_data_size;
			data += thisrun_data_size;
		}

		memset(oob_buffer, 0xff, 6);
		if (oob) {
			memcpy(oob_buffer, oob, thisrun_oob_size);
			oob_size -= thisrun_oob_size;
			oob += thisrun_oob_size;
		}

		/* write MLC_ECC_ENC_REG to start encode cycle */
		retval = target_write_u32(target, 0x200b8008, 0x0);
		if (retval != ERROR_OK) {
			LOG_ERROR("could not set MLC_ECC_ENC_REG");
			return ERROR_NAND_OPERATION_FAILED;
		}

