openocd-org/openocd/src/flash/nand/lpc32xx.c
		retval = target_write_memory(target, 0x200a8000,
				4, 128, page_buffer);
		if (retval != ERROR_OK) {
			LOG_ERROR("could not set MLC_BUF (data)");
			return ERROR_NAND_OPERATION_FAILED;
		}
		retval = target_write_memory(target, 0x200a8000,
				1, 6, oob_buffer);
		if (retval != ERROR_OK) {
			LOG_ERROR("could not set MLC_BUF (oob)");
			return ERROR_NAND_OPERATION_FAILED;
		}

		/* write MLC_ECC_AUTO_ENC_REG to start auto encode */
		retval = target_write_u32(target, 0x200b8010, 0x0);
		if (retval != ERROR_OK) {
			LOG_ERROR("could not set MLC_ECC_AUTO_ENC_REG");
			return ERROR_NAND_OPERATION_FAILED;
		}

		if (!lpc32xx_controller_ready(nand, 1000)) {
			LOG_ERROR("timeout while waiting for "
				"completion of auto encode cycle");
			return ERROR_NAND_OPERATION_FAILED;
		}
	}

	/* MLC_CMD = auto program command */
	retval = target_write_u32(target, 0x200b8000, NAND_CMD_PAGEPROG);
	if (retval != ERROR_OK) {
		LOG_ERROR("could not set MLC_CMD");
		return ERROR_NAND_OPERATION_FAILED;
	}

	retval = nand_read_status(nand, &status);
	if (retval != ERROR_OK) {
		LOG_ERROR("couldn't read status");
		return ERROR_NAND_OPERATION_FAILED;
	}

	if (status & NAND_STATUS_FAIL) {
		LOG_ERROR("write operation didn't pass, status: 0x%2.2x",
			status);
		return ERROR_NAND_OPERATION_FAILED;
	}

	return ERROR_OK;
}

/* SLC controller in !raw mode will use target cpu to read/write nand from/to
 * target internal memory.  The transfer to/from flash is done by DMA.  This
 * function sets up the dma linked list in host memory for later transfer to
 * target.
 */
static int lpc32xx_make_dma_list(uint32_t target_mem_base, uint32_t page_size,
	int do_read)
{
	uint32_t i, dmasrc, ctrl, ecc_ctrl, oob_ctrl, dmadst;

	/* DMACCxControl =
		TransferSize =64,
		Source burst size =16,
		Destination burst size = 16,
		Source transfer width = 32 bit,
		Destination transfer width = 32 bit,
		Source AHB master select = M0,
		Destination AHB master select = M0,
		Source increment = 0, // set later
		Destination increment = 0, // set later
		Terminal count interrupt enable bit = 0 // set on last
	*/			/*
	 * Write Operation Sequence for Small Block NAND
	 * ----------------------------------------------------------
	 * 1. X'fer 256 bytes of data from Memory to Flash.
	 * 2. Copy generated ECC data from Register to Spare Area
	 * 3. X'fer next 256 bytes of data from Memory to Flash.
	 * 4. Copy generated ECC data from Register to Spare Area.
	 * 5. X'fer 16 bytes of Spare area from Memory to Flash.
	 * Read Operation Sequence for Small Block NAND
	 * ----------------------------------------------------------
	 * 1. X'fer 256 bytes of data from Flash to Memory.
	 * 2. Copy generated ECC data from Register to ECC calc Buffer.
	 * 3. X'fer next 256 bytes of data from Flash to Memory.
	 * 4. Copy generated ECC data from Register to ECC calc Buffer.
	 * 5. X'fer 16 bytes of Spare area from Flash to Memory.
	 * Write Operation Sequence for Large Block NAND
	 * ----------------------------------------------------------
	 * 1. Steps(1-4) of Write Operations repeated for four times
	 * which generates 16 DMA descriptors to X'fer 2048 bytes of
	 * data & 32 bytes of ECC data.
	 * 2. X'fer 64 bytes of Spare area from Memory to Flash.
	 * Read Operation Sequence for Large Block NAND
	 * ----------------------------------------------------------
	 * 1. Steps(1-4) of Read Operations repeated for four times
	 * which generates 16 DMA descriptors to X'fer 2048 bytes of
	 * data & 32 bytes of ECC data.
	 * 2. X'fer 64 bytes of Spare area from Flash to Memory.
	 */

	ctrl = (0x40 | 3 << 12 | 3 << 15 | 2 << 18 | 2 << 21 | 0 << 24
		| 0 << 25 | 0 << 26 | 0 << 27 | 0 << 31);

	/* DMACCxControl =
		TransferSize =1,
		Source burst size =4,
		Destination burst size = 4,
		Source transfer width = 32 bit,
		Destination transfer width = 32 bit,
		Source AHB master select = M0,
		Destination AHB master select = M0,
		Source increment = 0,
		Destination increment = 1,
		Terminal count interrupt enable bit = 0
	 */
	ecc_ctrl = 0x01 | 1 << 12 | 1 << 15 | 2 << 18 | 2 << 21 | 0 << 24
		| 0 << 25 | 0 << 26 | 1 << 27 | 0 << 31;

	/* DMACCxControl =
		TransferSize =16 for lp or 4 for sp,
		Source burst size =16,
		Destination burst size = 16,
		Source transfer width = 32 bit,
		Destination transfer width = 32 bit,
		Source AHB master select = M0,
		Destination AHB master select = M0,
		Source increment = 0, // set later
		Destination increment = 0, // set later
		Terminal count interrupt enable bit = 1 // set on last
	 */
	oob_ctrl = (page_size == 2048 ? 0x10 : 0x04)
		| 3 << 12 | 3 << 15 | 2 << 18 | 2 << 21 | 0 << 24
		| 0 << 25 | 0 << 26 | 0 << 27 | 1 << 31;
	if (do_read) {
		ctrl |= 1 << 27;/* Destination increment = 1 */
		oob_ctrl |= 1 << 27;	/* Destination increment = 1 */
		dmasrc = 0x20020038;	/* SLC_DMA_DATA */
		dmadst = target_mem_base + DATA_OFFS;
	} else {
		ctrl |= 1 << 26;/* Source increment = 1 */
		oob_ctrl |= 1 << 26;	/* Source increment = 1 */
		dmasrc = target_mem_base + DATA_OFFS;
		dmadst = 0x20020038;	/* SLC_DMA_DATA */
	}
	/*
	 * Write Operation Sequence for Small Block NAND
	 * ----------------------------------------------------------
	 * 1. X'fer 256 bytes of data from Memory to Flash.
	 * 2. Copy generated ECC data from Register to Spare Area
	 * 3. X'fer next 256 bytes of data from Memory to Flash.
	 * 4. Copy generated ECC data from Register to Spare Area.
	 * 5. X'fer 16 bytes of Spare area from Memory to Flash.
	 * Read Operation Sequence for Small Block NAND
	 * ----------------------------------------------------------
	 * 1. X'fer 256 bytes of data from Flash to Memory.
	 * 2. Copy generated ECC data from Register to ECC calc Buffer.
	 * 3. X'fer next 256 bytes of data from Flash to Memory.
	 * 4. Copy generated ECC data from Register to ECC calc Buffer.
	 * 5. X'fer 16 bytes of Spare area from Flash to Memory.
	 * Write Operation Sequence for Large Block NAND
	 * ----------------------------------------------------------
	 * 1. Steps(1-4) of Write Operations repeated for four times
	 * which generates 16 DMA descriptors to X'fer 2048 bytes of
	 * data & 32 bytes of ECC data.
	 * 2. X'fer 64 bytes of Spare area from Memory to Flash.
	 * Read Operation Sequence for Large Block NAND
	 * ----------------------------------------------------------
	 * 1. Steps(1-4) of Read Operations repeated for four times
	 * which generates 16 DMA descriptors to X'fer 2048 bytes of
	 * data & 32 bytes of ECC data.
	 * 2. X'fer 64 bytes of Spare area from Flash to Memory.
	 */
	for (i = 0; i < page_size/0x100; i++) {
		dmalist[i*2].dma_src = (do_read ? dmasrc : (dmasrc + i * 256));
		dmalist[i*2].dma_dest = (do_read ? (dmadst + i * 256) : dmadst);
		dmalist[i*2].next_lli =
			target_mem_base + (i*2 + 1) * sizeof(struct dmac_ll);
		dmalist[i*2].next_ctrl = ctrl;

