openocd-org/openocd/src/flash/nand/lpc32xx.c
		dmalist[(i*2) + 1].dma_src = 0x20020034;/* SLC_ECC */
		dmalist[(i*2) + 1].dma_dest =
			target_mem_base + ECC_OFFS + i * 4;
		dmalist[(i*2) + 1].next_lli =
			target_mem_base + (i*2 + 2) * sizeof(struct dmac_ll);
		dmalist[(i*2) + 1].next_ctrl = ecc_ctrl;

	}
	if (do_read)
		dmadst = target_mem_base + SPARE_OFFS;
	else {
		dmasrc = target_mem_base + SPARE_OFFS;
		dmalist[(i*2) - 1].next_lli = 0;/* last link = null on write */
		dmalist[(i*2) - 1].next_ctrl |= (1 << 31);	/* Set TC enable */
	}
	dmalist[i*2].dma_src = dmasrc;
	dmalist[i*2].dma_dest = dmadst;
	dmalist[i*2].next_lli = 0;
	dmalist[i*2].next_ctrl = oob_ctrl;

	return i * 2 + 1;	/* Number of descriptors */
}

static int lpc32xx_start_slc_dma(struct nand_device *nand, uint32_t count,
	int do_wait)
{
	struct target *target = nand->target;
	int retval;

	/* DMACIntTCClear = ch0 */
	retval = target_write_u32(target, 0x31000008, 1);
	if (retval != ERROR_OK) {
		LOG_ERROR("Could not set DMACIntTCClear");
		return retval;
	}

	/* DMACIntErrClear = ch0 */
	retval = target_write_u32(target, 0x31000010, 1);
	if (retval != ERROR_OK) {
		LOG_ERROR("Could not set DMACIntErrClear");
		return retval;
	}

	/* DMACCxConfig=
		E=1,
		SrcPeripheral = 1 (SLC),
		DestPeripheral = 1 (SLC),
		FlowCntrl = 2 (Pher -> Mem, DMA),
		IE = 0,
		ITC = 0,
		L= 0,
		H=0
	*/
	retval = target_write_u32(target, 0x31000110,
			1 | 1<<1 | 1<<6 | 2<<11 | 0<<14
			| 0<<15 | 0<<16 | 0<<18);
	if (retval != ERROR_OK) {
		LOG_ERROR("Could not set DMACC0Config");
		return retval;
	}

	/* SLC_CTRL = 3 (START DMA), ECC_CLEAR */
	retval = target_write_u32(target, 0x20020010, 0x3);
	if (retval != ERROR_OK) {
		LOG_ERROR("Could not set SLC_CTRL");
		return retval;
	}

	/* SLC_ICR = 2, INT_TC_CLR, clear pending TC*/
	retval = target_write_u32(target, 0x20020028, 2);
	if (retval != ERROR_OK) {
		LOG_ERROR("Could not set SLC_ICR");
		return retval;
	}

	/* SLC_TC */
	retval = target_write_u32(target, 0x20020030, count);
	if (retval != ERROR_OK) {
		LOG_ERROR("lpc32xx_start_slc_dma: Could not set SLC_TC");
		return retval;
	}

	/* Wait finish */
	if (do_wait && !lpc32xx_tc_ready(nand, 100)) {
		LOG_ERROR("timeout while waiting for completion of DMA");
		return ERROR_NAND_OPERATION_FAILED;
	}

	return retval;
}

static int lpc32xx_dma_ready(struct nand_device *nand, int timeout)
{
	struct target *target = nand->target;

	LOG_DEBUG("lpc32xx_dma_ready count start=%d", timeout);

	do {
		uint32_t tc_stat;
		uint32_t err_stat;
		int retval;

		/* Read DMACRawIntTCStat */
		retval = target_read_u32(target, 0x31000014, &tc_stat);
		if (retval != ERROR_OK) {
			LOG_ERROR("Could not read DMACRawIntTCStat");
			return 0;
		}
		/* Read DMACRawIntErrStat */
		retval = target_read_u32(target, 0x31000018, &err_stat);
		if (retval != ERROR_OK) {
			LOG_ERROR("Could not read DMACRawIntErrStat");
			return 0;
		}
		if ((tc_stat | err_stat) & 1) {
			LOG_DEBUG("lpc32xx_dma_ready count=%d",
				timeout);
			if (err_stat & 1) {
				LOG_ERROR("lpc32xx_dma_ready "
					"DMA error, aborted");
				return 0;
			} else
				return 1;
		}

		alive_sleep(1);
	} while (timeout-- > 0);

	return 0;
}

static uint32_t slc_ecc_copy_to_buffer(uint8_t *spare,
	const uint32_t *ecc, int count)
{
	int i;
	for (i = 0; i < (count * 3); i += 3) {
		uint32_t ce = ecc[i/3];
		ce = ~(ce << 2) & 0xFFFFFF;
		spare[i+2] = (uint8_t)(ce & 0xFF); ce >>= 8;
		spare[i+1] = (uint8_t)(ce & 0xFF); ce >>= 8;
		spare[i]   = (uint8_t)(ce & 0xFF);
	}
	return 0;
}

static void lpc32xx_dump_oob(uint8_t *oob, uint32_t oob_size)
{
	int addr = 0;
	while (oob_size > 0) {
		LOG_DEBUG("%02x: %02x %02x %02x %02x %02x %02x %02x %02x", addr,
			oob[0], oob[1], oob[2], oob[3],
			oob[4], oob[5], oob[6], oob[7]);
		oob += 8;
		addr += 8;
		oob_size -= 8;
	}
}

static int lpc32xx_write_page_slc(struct nand_device *nand,
	struct working_area *pworking_area,
	uint32_t page, uint8_t *data,
	uint32_t data_size, uint8_t *oob,
	uint32_t oob_size)
{
	struct target *target = nand->target;
	int retval;
	uint32_t target_mem_base;

	LOG_DEBUG("SLC write page %" PRIx32 " data=%d, oob=%d, "
		"data_size=%" PRIu32 ", oob_size=%" PRIu32,
		page, !!data, !!oob, data_size, oob_size);

	target_mem_base = pworking_area->address;
	/*
	 * Skip writing page which has all 0xFF data as this will
	 * generate 0x0 value.
	 */
	if (data && !oob) {
		uint32_t i, all_ff = 1;
		for (i = 0; i < data_size; i++)
			if (data[i] != 0xFF) {
				all_ff = 0;
				break;
			}
		if (all_ff)
			return ERROR_OK;
	}
	/* Make the dma descriptors in local memory */
	int nll = lpc32xx_make_dma_list(target_mem_base, nand->page_size, 0);
	/* Write them to target.
	   XXX: Assumes host and target have same byte sex.
	*/
	retval = target_write_memory(target, target_mem_base, 4,
			nll * sizeof(struct dmac_ll) / 4,
			(uint8_t *)dmalist);
	if (retval != ERROR_OK) {
		LOG_ERROR("Could not write DMA descriptors to IRAM");
		return retval;
	}

	retval = nand_page_command(nand, page, NAND_CMD_SEQIN, !data);
	if (retval != ERROR_OK) {
		LOG_ERROR("NAND_CMD_SEQIN failed");
		return retval;
	}

	/* SLC_CFG =
	       Force nCE assert,
	       DMA ECC enabled,
	       ECC enabled,
	       DMA burst enabled,
	       DMA write to SLC,
	       WIDTH = bus_width
	*/
	retval = target_write_u32(target, 0x20020014, 0x3c);
	if (retval != ERROR_OK) {
		LOG_ERROR("Could not set SLC_CFG");
		return retval;
	}
	if (data) {
		/* Write data to target */
		static uint8_t fdata[2048];
		memset(fdata, 0xFF, nand->page_size);
		memcpy(fdata, data, data_size);
		retval = target_write_memory(target,
				target_mem_base + DATA_OFFS,
				4, nand->page_size/4, fdata);
		if (retval != ERROR_OK) {
			LOG_ERROR("Could not write data to IRAM");
			return retval;
		}

		/* Write first descriptor to DMA controller */
		retval = target_write_memory(target, 0x31000100, 4,
				sizeof(struct dmac_ll) / 4,
				(uint8_t *)dmalist);
		if (retval != ERROR_OK) {
			LOG_ERROR("Could not write DMA descriptor to DMAC");
			return retval;
		}

		/* Start xfer of data from iram to flash using DMA */
		int tot_size = nand->page_size;
		tot_size += tot_size == 2048 ? 64 : 16;
		retval = lpc32xx_start_slc_dma(nand, tot_size, 0);
		if (retval != ERROR_OK) {
			LOG_ERROR("DMA failed");
			return retval;
		}

		/* Wait for DMA to finish.  SLC is not finished at this stage */
		if (!lpc32xx_dma_ready(nand, 100)) {
			LOG_ERROR("Data DMA failed during write");
			return ERROR_FLASH_OPERATION_FAILED;
		}
	}	/* data xfer */

	/* Copy OOB to iram */
	static uint8_t foob[64];
	int foob_size = nand->page_size == 2048 ? 64 : 16;
	memset(foob, 0xFF, foob_size);
	if (oob)	/* Raw mode */
		memcpy(foob, oob, oob_size);
	else {
		/* Get HW generated ECC, made while writing data */
		int ecc_count = nand->page_size == 2048 ? 8 : 2;
		static uint32_t hw_ecc[8];
		retval = target_read_memory(target, target_mem_base + ECC_OFFS,
				4, ecc_count, (uint8_t *)hw_ecc);
		if (retval != ERROR_OK) {
			LOG_ERROR("Reading hw generated ECC from IRAM failed");
			return retval;
		}
		/* Copy to oob, at correct offsets */
		static uint8_t ecc[24];
		slc_ecc_copy_to_buffer(ecc, hw_ecc, ecc_count);
		const int *layout = nand->page_size == 2048 ? lp_ooblayout : sp_ooblayout;
		int i;
		for (i = 0; i < ecc_count * 3; i++)
			foob[layout[i]] = ecc[i];
		lpc32xx_dump_oob(foob, foob_size);
	}
	retval = target_write_memory(target, target_mem_base + SPARE_OFFS, 4,
			foob_size / 4, foob);
	if (retval != ERROR_OK) {
		LOG_ERROR("Writing OOB to IRAM failed");
		return retval;
	}

	/* Write OOB descriptor to DMA controller */
	retval = target_write_memory(target, 0x31000100, 4,
			sizeof(struct dmac_ll) / 4,
			(uint8_t *)(&dmalist[nll-1]));
	if (retval != ERROR_OK) {
		LOG_ERROR("Could not write OOB DMA descriptor to DMAC");
		return retval;
	}
	if (data) {
		/* Only restart DMA with last descriptor,
		 * don't setup SLC again */

