openocd-org/openocd/src/flash/nand/lpc32xx.c
		/* DMACIntTCClear = ch0 */
		retval = target_write_u32(target, 0x31000008, 1);
		if (retval != ERROR_OK) {
			LOG_ERROR("Could not set DMACIntTCClear");
			return retval;
		}
		/* DMACCxConfig=
		 * E=1,
		 * SrcPeripheral = 1 (SLC),
		 * DestPeripheral = 1 (SLC),
		 * FlowCntrl = 2 (Pher -> Mem, DMA),
		 * IE = 0,
		 * ITC = 0,
		 * L= 0,
		 * H=0
		*/
		retval = target_write_u32(target, 0x31000110,
				1 | 1<<1 | 1<<6 | 2<<11 | 0<<14
				| 0<<15 | 0<<16 | 0<<18);
		if (retval != ERROR_OK) {
			LOG_ERROR("Could not set DMACC0Config");
			return retval;
		}
		/* Wait finish */
		if (!lpc32xx_tc_ready(nand, 100)) {
			LOG_ERROR("timeout while waiting for "
				"completion of DMA");
			return ERROR_NAND_OPERATION_FAILED;
		}
	} else {
		/* Start xfer of data from iram to flash using DMA */
		retval = lpc32xx_start_slc_dma(nand, foob_size, 1);
		if (retval != ERROR_OK) {
			LOG_ERROR("DMA OOB failed");
			return retval;
		}
	}

	/* Let NAND start actual writing */
	retval = nand_write_finish(nand);
	if (retval != ERROR_OK) {
		LOG_ERROR("nand_write_finish failed");
		return retval;
	}

	return ERROR_OK;
}

static int lpc32xx_write_page(struct nand_device *nand, uint32_t page,
	uint8_t *data, uint32_t data_size,
	uint8_t *oob, uint32_t oob_size)
{
	struct lpc32xx_nand_controller *lpc32xx_info = nand->controller_priv;
	struct target *target = nand->target;
	int retval = ERROR_OK;

	if (target->state != TARGET_HALTED) {
		LOG_ERROR("target must be halted to use LPC32xx "
			"NAND flash controller");
		return ERROR_NAND_OPERATION_FAILED;
	}

	if (lpc32xx_info->selected_controller == LPC32XX_NO_CONTROLLER) {
		LOG_ERROR("BUG: no LPC32xx NAND flash controller selected");
		return ERROR_NAND_OPERATION_FAILED;
	} else if (lpc32xx_info->selected_controller == LPC32XX_MLC_CONTROLLER) {
		if (!data && oob) {
			LOG_ERROR("LPC32xx MLC controller can't write "
				"OOB data only");
			return ERROR_NAND_OPERATION_NOT_SUPPORTED;
		}

		if (oob && (oob_size > 24)) {
			LOG_ERROR("LPC32xx MLC controller can't write more "
				"than 6 bytes for each quarter's OOB data");
			return ERROR_NAND_OPERATION_NOT_SUPPORTED;
		}

		if (data_size > (uint32_t)nand->page_size) {
			LOG_ERROR("data size exceeds page size");
			return ERROR_NAND_OPERATION_NOT_SUPPORTED;
		}

		retval = lpc32xx_write_page_mlc(nand, page, data, data_size,
				oob, oob_size);
	} else if (lpc32xx_info->selected_controller == LPC32XX_SLC_CONTROLLER) {
		struct working_area *pworking_area;
		if (!data && oob) {
			/*
			 * if oob only mode is active original method is used
			 * as SLC controller hangs during DMA interworking. (?)
			 * Anyway the code supports the oob only mode below.
			 */
			return nand_write_page_raw(nand, page, data,
				data_size, oob, oob_size);
		}
		retval = target_alloc_working_area(target,
				nand->page_size + DATA_OFFS,
				&pworking_area);
		if (retval != ERROR_OK) {
			LOG_ERROR("Can't allocate working area in "
				"LPC internal RAM");
			return ERROR_FLASH_OPERATION_FAILED;
		}
		retval = lpc32xx_write_page_slc(nand, pworking_area, page,
				data, data_size, oob, oob_size);
		target_free_working_area(target, pworking_area);
	}

	return retval;
}

static int lpc32xx_read_page_mlc(struct nand_device *nand, uint32_t page,
	uint8_t *data, uint32_t data_size,
	uint8_t *oob, uint32_t oob_size)
{
	struct target *target = nand->target;
	static uint8_t page_buffer[2048];
	static uint8_t oob_buffer[64];
	uint32_t page_bytes_done = 0;
	uint32_t oob_bytes_done = 0;
	uint32_t mlc_isr;
	int retval;

	if (!data && oob) {
		/* MLC_CMD = Read OOB
		 * we can use the READOOB command on both small and large page
		 * devices, as the controller translates the 0x50 command to
		 * a 0x0 with appropriate positioning of the serial buffer
		 * read pointer
		 */
		retval = target_write_u32(target, 0x200b8000, NAND_CMD_READOOB);
	} else {
		/* MLC_CMD = Read0 */
		retval = target_write_u32(target, 0x200b8000, NAND_CMD_READ0);
	}
	if (retval != ERROR_OK) {
		LOG_ERROR("could not set MLC_CMD");
		return ERROR_NAND_OPERATION_FAILED;
	}
	if (nand->page_size == 512) {
		/* small page device
		 * MLC_ADDR = 0x0 (one column cycle) */
		retval = target_write_u32(target, 0x200b8004, 0x0);
		if (retval != ERROR_OK) {
			LOG_ERROR("could not set MLC_ADDR");
			return ERROR_NAND_OPERATION_FAILED;
		}

		/* MLC_ADDR = row */
		retval = target_write_u32(target, 0x200b8004, page & 0xff);
		if (retval != ERROR_OK) {
			LOG_ERROR("could not set MLC_ADDR");
			return ERROR_NAND_OPERATION_FAILED;
		}
		retval = target_write_u32(target, 0x200b8004,
				(page >> 8) & 0xff);
		if (retval != ERROR_OK) {
			LOG_ERROR("could not set MLC_ADDR");
			return ERROR_NAND_OPERATION_FAILED;
		}

		if (nand->address_cycles == 4) {
			retval = target_write_u32(target, 0x200b8004,
					(page >> 16) & 0xff);
			if (retval != ERROR_OK) {
				LOG_ERROR("could not set MLC_ADDR");
				return ERROR_NAND_OPERATION_FAILED;
			}
		}
	} else {
		/* large page device
		 * MLC_ADDR = 0x0 (two column cycles) */
		retval = target_write_u32(target, 0x200b8004, 0x0);
		if (retval != ERROR_OK) {
			LOG_ERROR("could not set MLC_ADDR");
			return ERROR_NAND_OPERATION_FAILED;
		}
		retval = target_write_u32(target, 0x200b8004, 0x0);
		if (retval != ERROR_OK) {
			LOG_ERROR("could not set MLC_ADDR");
			return ERROR_NAND_OPERATION_FAILED;
		}

		/* MLC_ADDR = row */
		retval = target_write_u32(target, 0x200b8004, page & 0xff);
		if (retval != ERROR_OK) {
			LOG_ERROR("could not set MLC_ADDR");
			return ERROR_NAND_OPERATION_FAILED;
		}
		retval = target_write_u32(target, 0x200b8004,
				(page >> 8) & 0xff);
		if (retval != ERROR_OK) {
			LOG_ERROR("could not set MLC_ADDR");
			return ERROR_NAND_OPERATION_FAILED;
		}

		/* MLC_CMD = Read Start */
		retval = target_write_u32(target, 0x200b8000,
				NAND_CMD_READSTART);
		if (retval != ERROR_OK) {
			LOG_ERROR("could not set MLC_CMD");
			return ERROR_NAND_OPERATION_FAILED;
		}
	}

	while (page_bytes_done < (uint32_t)nand->page_size) {
		/* MLC_ECC_AUTO_DEC_REG = dummy */
		retval = target_write_u32(target, 0x200b8014, 0xaa55aa55);
		if (retval != ERROR_OK) {
			LOG_ERROR("could not set MLC_ECC_AUTO_DEC_REG");
			return ERROR_NAND_OPERATION_FAILED;
		}

		if (!lpc32xx_controller_ready(nand, 1000)) {
			LOG_ERROR("timeout while waiting for "
				"completion of auto decode cycle");
			return ERROR_NAND_OPERATION_FAILED;
		}

		retval = target_read_u32(target, 0x200b8048, &mlc_isr);
		if (retval != ERROR_OK) {
			LOG_ERROR("could not read MLC_ISR");
			return ERROR_NAND_OPERATION_FAILED;
		}

