openocd-org/openocd/src/flash/nand/lpc32xx.c
		if (mlc_isr & 0x8) {
			if (mlc_isr & 0x40) {
				LOG_ERROR("uncorrectable error detected: 0x%2.2" PRIx32, mlc_isr);
				return ERROR_NAND_OPERATION_FAILED;
			}

			LOG_WARNING("%i symbol error detected and corrected",
				((int)(((mlc_isr & 0x30) >> 4) + 1)));
		}

		if (data) {
			retval = target_read_memory(target, 0x200a8000, 4, 128,
					page_buffer + page_bytes_done);
			if (retval != ERROR_OK) {
				LOG_ERROR("could not read MLC_BUF (data)");
				return ERROR_NAND_OPERATION_FAILED;
			}
		}

		if (oob) {
			retval = target_read_memory(target, 0x200a8000, 4, 4,
					oob_buffer + oob_bytes_done);
			if (retval != ERROR_OK) {
				LOG_ERROR("could not read MLC_BUF (oob)");
				return ERROR_NAND_OPERATION_FAILED;
			}
		}

		page_bytes_done += 512;
		oob_bytes_done += 16;
	}

	if (data)
		memcpy(data, page_buffer, data_size);

	if (oob)
		memcpy(oob, oob_buffer, oob_size);

	return ERROR_OK;
}

static int lpc32xx_read_page_slc(struct nand_device *nand,
	struct working_area *pworking_area,
	uint32_t page, uint8_t *data,
	uint32_t data_size, uint8_t *oob,
	uint32_t oob_size)
{
	struct target *target = nand->target;
	int retval;
	uint32_t target_mem_base;

	LOG_DEBUG("SLC read page %" PRIx32 " data=%" PRIu32 ", oob=%" PRIu32,
		page, data_size, oob_size);

	target_mem_base = pworking_area->address;

	/* Make the dma descriptors in local memory */
	int nll = lpc32xx_make_dma_list(target_mem_base, nand->page_size, 1);
	/* Write them to target.
	   XXX: Assumes host and target have same byte sex.
	*/
	retval = target_write_memory(target, target_mem_base, 4,
			nll * sizeof(struct dmac_ll) / 4,
			(uint8_t *)dmalist);
	if (retval != ERROR_OK) {
		LOG_ERROR("Could not write DMA descriptors to IRAM");
		return retval;
	}

	retval = nand_page_command(nand, page, NAND_CMD_READ0, 0);
	if (retval != ERROR_OK) {
		LOG_ERROR("lpc32xx_read_page_slc: NAND_CMD_READ0 failed");
		return retval;
	}

	/* SLC_CFG =
	       Force nCE assert,
	       DMA ECC enabled,
	       ECC enabled,
	       DMA burst enabled,
	       DMA read from SLC,
	       WIDTH = bus_width
	*/
	retval = target_write_u32(target, 0x20020014, 0x3e);
	if (retval != ERROR_OK) {
		LOG_ERROR("lpc32xx_read_page_slc: Could not set SLC_CFG");
		return retval;
	}

	/* Write first descriptor to DMA controller */
	retval = target_write_memory(target, 0x31000100, 4,
			sizeof(struct dmac_ll) / 4, (uint8_t *)dmalist);
	if (retval != ERROR_OK) {
		LOG_ERROR("Could not write DMA descriptor to DMAC");
		return retval;
	}

	/* Start xfer of data from flash to iram using DMA */
	int tot_size = nand->page_size;
	tot_size += nand->page_size == 2048 ? 64 : 16;
	retval = lpc32xx_start_slc_dma(nand, tot_size, 1);
	if (retval != ERROR_OK) {
		LOG_ERROR("lpc32xx_read_page_slc: DMA read failed");
		return retval;
	}

	/* Copy data from iram */
	if (data) {
		retval = target_read_memory(target, target_mem_base + DATA_OFFS,
				4, data_size/4, data);
		if (retval != ERROR_OK) {
			LOG_ERROR("Could not read data from IRAM");
			return retval;
		}
	}
	if (oob) {
		/* No error correction, just return data as read from flash */
		retval = target_read_memory(target,
				target_mem_base + SPARE_OFFS, 4,
				oob_size/4, oob);
		if (retval != ERROR_OK) {
			LOG_ERROR("Could not read OOB from IRAM");
			return retval;
		}
		return ERROR_OK;
	}

	/* Copy OOB from flash, stored in IRAM */
	static uint8_t foob[64];
	retval = target_read_memory(target, target_mem_base + SPARE_OFFS,
			4, nand->page_size == 2048 ? 16 : 4, foob);
	lpc32xx_dump_oob(foob, nand->page_size == 2048 ? 64 : 16);
	if (retval != ERROR_OK) {
		LOG_ERROR("Could not read OOB from IRAM");
		return retval;
	}
	/* Copy ECC from HW, generated while reading */
	int ecc_count = nand->page_size == 2048 ? 8 : 2;
	static uint32_t hw_ecc[8];	/* max size */
	retval = target_read_memory(target, target_mem_base + ECC_OFFS, 4,
			ecc_count, (uint8_t *)hw_ecc);
	if (retval != ERROR_OK) {
		LOG_ERROR("Could not read hw generated ECC from IRAM");
		return retval;
	}
	static uint8_t ecc[24];
	slc_ecc_copy_to_buffer(ecc, hw_ecc, ecc_count);
	/* Copy ECC from flash using correct layout */
	static uint8_t fecc[24];/* max size */
	const int *layout = nand->page_size == 2048 ? lp_ooblayout : sp_ooblayout;
	int i;
	for (i = 0; i < ecc_count * 3; i++)
		fecc[i] = foob[layout[i]];
	/* Compare ECC and possibly correct data */
	for (i = 0; i < ecc_count; i++) {
		retval = nand_correct_data(nand, data + 256*i, &fecc[i * 3],
				&ecc[i * 3]);
		if (retval > 0)
			LOG_WARNING("error detected and corrected: %" PRIu32 "/%d",
				page, i);
		if (retval < 0)
			break;
	}
	if (i == ecc_count)
		retval = ERROR_OK;
	else {
		LOG_ERROR("uncorrectable error detected: %" PRIu32 "/%d", page, i);
		retval = ERROR_NAND_OPERATION_FAILED;
	}
	return retval;
}

static int lpc32xx_read_page(struct nand_device *nand, uint32_t page,
	uint8_t *data, uint32_t data_size,
	uint8_t *oob, uint32_t oob_size)
{
	struct lpc32xx_nand_controller *lpc32xx_info = nand->controller_priv;
	struct target *target = nand->target;
	int retval = ERROR_OK;

	if (target->state != TARGET_HALTED) {
		LOG_ERROR("target must be halted to use LPC32xx "
			"NAND flash controller");
		return ERROR_NAND_OPERATION_FAILED;
	}

	if (lpc32xx_info->selected_controller == LPC32XX_NO_CONTROLLER) {
		LOG_ERROR("BUG: no LPC32xx NAND flash controller selected");
		return ERROR_NAND_OPERATION_FAILED;
	} else if (lpc32xx_info->selected_controller == LPC32XX_MLC_CONTROLLER) {
		if (data_size > (uint32_t)nand->page_size) {
			LOG_ERROR("data size exceeds page size");
			return ERROR_NAND_OPERATION_NOT_SUPPORTED;
		}
		retval = lpc32xx_read_page_mlc(nand, page, data, data_size,
				oob, oob_size);
	} else if (lpc32xx_info->selected_controller == LPC32XX_SLC_CONTROLLER) {
		struct working_area *pworking_area;

		retval = target_alloc_working_area(target,
				nand->page_size + 0x200,
				&pworking_area);
		if (retval != ERROR_OK) {
			LOG_ERROR("Can't allocate working area in "
				"LPC internal RAM");
			return ERROR_FLASH_OPERATION_FAILED;
		}
		retval = lpc32xx_read_page_slc(nand, pworking_area, page,
				data, data_size, oob, oob_size);
		target_free_working_area(target, pworking_area);
	}

	return retval;
}

static int lpc32xx_controller_ready(struct nand_device *nand, int timeout)
{
	struct lpc32xx_nand_controller *lpc32xx_info = nand->controller_priv;
	struct target *target = nand->target;
	int retval;

	if (target->state != TARGET_HALTED) {
		LOG_ERROR("target must be halted to use LPC32xx "
			"NAND flash controller");
		return ERROR_NAND_OPERATION_FAILED;
	}

