openocd-org/openocd/src/flash/nand/lpc32xx.c
	LOG_DEBUG("lpc32xx_controller_ready count start=%d", timeout);

	do {
		if (lpc32xx_info->selected_controller == LPC32XX_MLC_CONTROLLER) {
			uint8_t status;

			/* Read MLC_ISR, wait for controller to become ready */
			retval = target_read_u8(target, 0x200b8048, &status);
			if (retval != ERROR_OK) {
				LOG_ERROR("could not set MLC_STAT");
				return ERROR_NAND_OPERATION_FAILED;
			}

			if (status & 2) {
				LOG_DEBUG("lpc32xx_controller_ready count=%d",
					timeout);
				return 1;
			}
		} else if (lpc32xx_info->selected_controller == LPC32XX_SLC_CONTROLLER) {
			uint32_t status;

			/* Read SLC_STAT and check READY bit */
			retval = target_read_u32(target, 0x20020018, &status);
			if (retval != ERROR_OK) {
				LOG_ERROR("could not set SLC_STAT");
				return ERROR_NAND_OPERATION_FAILED;
			}

			if (status & 1) {
				LOG_DEBUG("lpc32xx_controller_ready count=%d",
					timeout);
				return 1;
			}
		}

		alive_sleep(1);
	} while (timeout-- > 0);

	return 0;
}

static int lpc32xx_nand_ready(struct nand_device *nand, int timeout)
{
	struct lpc32xx_nand_controller *lpc32xx_info = nand->controller_priv;
	struct target *target = nand->target;
	int retval;

	if (target->state != TARGET_HALTED) {
		LOG_ERROR("target must be halted to use LPC32xx "
			"NAND flash controller");
		return ERROR_NAND_OPERATION_FAILED;
	}

	LOG_DEBUG("lpc32xx_nand_ready count start=%d", timeout);

	do {
		if (lpc32xx_info->selected_controller == LPC32XX_MLC_CONTROLLER) {
			uint8_t status = 0x0;

			/* Read MLC_ISR, wait for NAND flash device to
			 * become ready */
			retval = target_read_u8(target, 0x200b8048, &status);
			if (retval != ERROR_OK) {
				LOG_ERROR("could not read MLC_ISR");
				return ERROR_NAND_OPERATION_FAILED;
			}

			if (status & 1) {
				LOG_DEBUG("lpc32xx_nand_ready count end=%d",
					timeout);
				return 1;
			}
		} else if (lpc32xx_info->selected_controller == LPC32XX_SLC_CONTROLLER) {
			uint32_t status = 0x0;

			/* Read SLC_STAT and check READY bit */
			retval = target_read_u32(target, 0x20020018, &status);
			if (retval != ERROR_OK) {
				LOG_ERROR("could not read SLC_STAT");
				return ERROR_NAND_OPERATION_FAILED;
			}

			if (status & 1) {
				LOG_DEBUG("lpc32xx_nand_ready count end=%d",
					timeout);
				return 1;
			}
		}

		alive_sleep(1);
	} while (timeout-- > 0);

	return 0;
}

static int lpc32xx_tc_ready(struct nand_device *nand, int timeout)
{
	struct target *target = nand->target;

	LOG_DEBUG("lpc32xx_tc_ready count start=%d", timeout);

	do {
		uint32_t status = 0x0;
		int retval;
		/* Read SLC_INT_STAT and check INT_TC_STAT bit */
		retval = target_read_u32(target, 0x2002001c, &status);
		if (retval != ERROR_OK) {
			LOG_ERROR("Could not read SLC_INT_STAT");
			return 0;
		}
		if (status & 2) {
			LOG_DEBUG("lpc32xx_tc_ready count=%d", timeout);
			return 1;
		}

		alive_sleep(1);
	} while (timeout-- > 0);

	return 0;
}

COMMAND_HANDLER(handle_lpc32xx_select_command)
{
	struct lpc32xx_nand_controller *lpc32xx_info = NULL;
	char *selected[] = {
		"no", "mlc", "slc"
	};

	if ((CMD_ARGC < 1) || (CMD_ARGC > 3))
		return ERROR_COMMAND_SYNTAX_ERROR;

	unsigned int num;
	COMMAND_PARSE_NUMBER(uint, CMD_ARGV[0], num);
	struct nand_device *nand = get_nand_device_by_num(num);
	if (!nand) {
		command_print(CMD, "nand device '#%s' is out of bounds",
			CMD_ARGV[0]);
		return ERROR_OK;
	}

	lpc32xx_info = nand->controller_priv;

	if (CMD_ARGC >= 2) {
		if (strcmp(CMD_ARGV[1], "mlc") == 0) {
			lpc32xx_info->selected_controller =
				LPC32XX_MLC_CONTROLLER;
		} else if (strcmp(CMD_ARGV[1], "slc") == 0) {
			lpc32xx_info->selected_controller =
				LPC32XX_SLC_CONTROLLER;
		} else
			return ERROR_COMMAND_SYNTAX_ERROR;
	}

	command_print(CMD, "%s controller selected",
		selected[lpc32xx_info->selected_controller]);

	return ERROR_OK;
}

static const struct command_registration lpc32xx_exec_command_handlers[] = {
	{
		.name = "select",
		.handler = handle_lpc32xx_select_command,
		.mode = COMMAND_EXEC,
		.help = "select MLC or SLC controller (default is MLC)",
		.usage = "bank_id ['mlc'|'slc' ]",
	},
	COMMAND_REGISTRATION_DONE
};
static const struct command_registration lpc32xx_command_handler[] = {
	{
		.name = "lpc32xx",
		.mode = COMMAND_ANY,
		.help = "LPC32xx NAND flash controller commands",
		.usage = "",
		.chain = lpc32xx_exec_command_handlers,
	},
	COMMAND_REGISTRATION_DONE
};

struct nand_flash_controller lpc32xx_nand_controller = {
	.name = "lpc32xx",
	.commands = lpc32xx_command_handler,
	.nand_device_command = lpc32xx_nand_device_command,
	.init = lpc32xx_init,
	.reset = lpc32xx_reset,
	.command = lpc32xx_command,
	.address = lpc32xx_address,
	.write_data = lpc32xx_write_data,
	.read_data = lpc32xx_read_data,
	.write_page = lpc32xx_write_page,
	.read_page = lpc32xx_read_page,
	.nand_ready = lpc32xx_nand_ready,
};
